ka2_2024/src/Enums/ВидыОперацийЗЕРНО/ВидыОперацийЗЕРНО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийЗЕРНО</name>
  <enumValues>
    <name>АннулированиеСДИЗ</name>
  </enumValues>
  <enumValues>
    <name>АннулированиеСДИЗРасчетСтатуса</name>
  </enumValues>
  <enumValues>
    <name>АннулированиеСписанияПартии</name>
  </enumValues>
  <enumValues>
    <name>АннулированиеФормированияПартии</name>
  </enumValues>
  <enumValues>
    <name>ВнесениеСведенийОСобранномУрожае</name>
  </enumValues>
  <enumValues>
    <name>ВнесениеСведенийОСобранномУрожаеАннулирование</name>
  </enumValues>
  <enumValues>
    <name>ВнесениеСведенийОСобранномУрожаеРасчетСтатуса</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузкаОстатковПартий</name>
  </enumValues>
  <enumValues>
    <name>ЗапросКлассификатора</name>
  </enumValues>
  <enumValues>
    <name>ЗапросКлассификатораАбстрактнаяОперация</name>
  </enumValues>
  <enumValues>
    <name>ЗапросМестФормированияПартий</name>
  </enumValues>
  <enumValues>
    <name>ЗапросМестФормированияПартийАбстрактнаяОперация</name>
  </enumValues>
  <enumValues>
    <name>ЗапросОтказовПогашенийСДИЗ</name>
  </enumValues>
  <enumValues>
    <name>ЗапросПартий</name>
  </enumValues>
  <enumValues>
    <name>ЗапросПартийНаХранении</name>
  </enumValues>
  <enumValues>
    <name>ЗапросПартийРасчетСтатуса</name>
  </enumValues>
  <enumValues>
    <name>ЗапросПогашенийСДИЗ</name>
  </enumValues>
  <enumValues>
    <name>ЗапросРеестраЭлеваторов</name>
  </enumValues>
  <enumValues>
    <name>ЗапросРезультатовИсследований</name>
  </enumValues>
  <enumValues>
    <name>ЗапросРезультатовИсследованийАбстрактнаяОперация</name>
  </enumValues>
  <enumValues>
    <name>ЗапросСДИЗ</name>
  </enumValues>
  <enumValues>
    <name>ЗапросСДИЗАбстрактнаяОперация</name>
  </enumValues>
  <enumValues>
    <name>МестоФормированияПартииРасчетСтатуса</name>
  </enumValues>
  <enumValues>
    <name>МестоФормированияПартииСоздание</name>
  </enumValues>
  <enumValues>
    <name>МестоФормированияПартииУдаление</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеСДИЗИмпорт</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеСДИЗОтказПогашенияСДИЗ</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеСДИЗОтказПогашенияСДИЗАннулирование</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеСДИЗРасчетСтатуса</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеСДИЗРФ</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеСДИЗЭкспорт</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеСДИЗЭлеватор</name>
  </enumValues>
  <enumValues>
    <name>ПогашениеСДИЗ</name>
  </enumValues>
  <enumValues>
    <name>ПогашениеСДИЗАннулирование</name>
  </enumValues>
  <enumValues>
    <name>ПогашениеСДИЗРасчетСтатуса</name>
  </enumValues>
  <enumValues>
    <name>СписаниеПартии</name>
  </enumValues>
  <enumValues>
    <name>СписаниеПартиийРасчетСтатуса</name>
  </enumValues>
  <enumValues>
    <name>ФормированиеПартии</name>
  </enumValues>
  <enumValues>
    <name>ФормированиеПартииИзДругихПартий</name>
  </enumValues>
  <enumValues>
    <name>ФормированиеПартииИзОстатков</name>
  </enumValues>
  <enumValues>
    <name>ФормированиеПартииИмпорт</name>
  </enumValues>
  <enumValues>
    <name>ФормированиеПартииНаОсновеБумажногоСДИЗ</name>
  </enumValues>
  <enumValues>
    <name>ФормированиеПартииПоРезультатамГосмониторинга</name>
  </enumValues>
  <enumValues>
    <name>ФормированиеПартииПриСбореУрожая</name>
  </enumValues>
  <enumValues>
    <name>ФормированиеПартииПроизводство</name>
  </enumValues>
  <enumValues>
    <name>ФормированиеПартииРасчетСтатуса</name>
  </enumValues>
</mdclass:Enum>

ka2_2024/src/Enums/ВидыОперацийЗЕРНО/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция ЭтоАбстрактнаяОперация(ВидОперации) Экспорт
	
	Если АбстрактныеОперации().Найти(ВидОперации) = Неопределено Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

Функция ОперацияЯвляетсяОснованием(ВидОперации) Экспорт
	
	Если ОперацииОснования().Найти(ВидОперации) = Неопределено Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

Функция ЭтоОперацияДополнительногоЗапроса(ВидОперации) Экспорт
	
	Если ОперацииССобственнымиЗапросами().Найти(ВидОперации) = Неопределено Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

Функция АбстрактныеОперации() Экспорт
	
	МассивОпераций = Новый Массив();
	МассивОпераций.Добавить(ФормированиеПартииРасчетСтатуса);
	МассивОпераций.Добавить(ОформлениеСДИЗРасчетСтатуса);
	МассивОпераций.Добавить(СписаниеПартиийРасчетСтатуса);
	МассивОпераций.Добавить(ЗапросПартийРасчетСтатуса);
	МассивОпераций.Добавить(ПогашениеСДИЗРасчетСтатуса);
	МассивОпераций.Добавить(ЗапросКлассификатораАбстрактнаяОперация);
	МассивОпераций.Добавить(ЗапросМестФормированияПартийАбстрактнаяОперация);
	МассивОпераций.Добавить(ЗапросРезультатовИсследованийАбстрактнаяОперация);
	МассивОпераций.Добавить(ЗапросСДИЗАбстрактнаяОперация);
	МассивОпераций.Добавить(ВнесениеСведенийОСобранномУрожаеРасчетСтатуса);
	МассивОпераций.Добавить(МестоФормированияПартииРасчетСтатуса);
	МассивОпераций.Добавить(АннулированиеСДИЗРасчетСтатуса);
	
	Возврат МассивОпераций;
	
КонецФункции

Функция ОперацииОснования() Экспорт
	
	МассивОпераций = Новый Массив();
	МассивОпераций.Добавить(ЗапросПартийРасчетСтатуса);
	МассивОпераций.Добавить(ЗапросКлассификатораАбстрактнаяОперация);
	МассивОпераций.Добавить(ЗапросМестФормированияПартийАбстрактнаяОперация);
	МассивОпераций.Добавить(ЗапросРезультатовИсследованийАбстрактнаяОперация);
	МассивОпераций.Добавить(ЗапросСДИЗАбстрактнаяОперация);
	
	Возврат МассивОпераций;
	
КонецФункции

Функция ОперацииССобственнымиЗапросами()
	
	МассивОпераций = Новый Массив();
	МассивОпераций.Добавить(ЗапросРеестраЭлеваторов);
		
	Возврат МассивОпераций;
	
КонецФункции

Функция ОперацииРасчетСтатуса() Экспорт
	
	МассивОпераций = Новый Массив();
	МассивОпераций.Добавить(ФормированиеПартииРасчетСтатуса);
	МассивОпераций.Добавить(ОформлениеСДИЗРасчетСтатуса);
	МассивОпераций.Добавить(СписаниеПартиийРасчетСтатуса);
	МассивОпераций.Добавить(ПогашениеСДИЗРасчетСтатуса);
	МассивОпераций.Добавить(ВнесениеСведенийОСобранномУрожаеРасчетСтатуса);
	МассивОпераций.Добавить(МестоФормированияПартииРасчетСтатуса);
	МассивОпераций.Добавить(АннулированиеСДИЗРасчетСтатуса);
	
	Возврат МассивОпераций;
	
КонецФункции

Функция БазовыеОперации() Экспорт
	
	МассивОпераций = Новый Массив();
	МассивОпераций.Добавить(ФормированиеПартииИзОстатков);
	МассивОпераций.Добавить(ФормированиеПартииИмпорт);
	МассивОпераций.Добавить(ФормированиеПартииПоРезультатамГосмониторинга);
	МассивОпераций.Добавить(ФормированиеПартииПриСбореУрожая);
	МассивОпераций.Добавить(ФормированиеПартииИзДругихПартий);
	МассивОпераций.Добавить(ФормированиеПартииПроизводство);
	МассивОпераций.Добавить(АннулированиеФормированияПартии);
	
	МассивОпераций.Добавить(ОформлениеСДИЗИмпорт);
	МассивОпераций.Добавить(ОформлениеСДИЗЭкспорт);
	МассивОпераций.Добавить(ОформлениеСДИЗРФ);
	МассивОпераций.Добавить(ОформлениеСДИЗЭлеватор);
	МассивОпераций.Добавить(АннулированиеСДИЗ);
	
	МассивОпераций.Добавить(МестоФормированияПартииСоздание);
	МассивОпераций.Добавить(ПогашениеСДИЗ);
	МассивОпераций.Добавить(СписаниеПартии);
	
	Возврат МассивОпераций;
	
КонецФункции

#КонецОбласти

#КонецЕсли
